podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/DMAMUX0_32CH_TRIG_MK28F15.svd.xml
<!--
Devices using this peripheral: 
      MK28F15
      MK65F18
      MK66F18
      MK82F25615
-->
      <peripheral>
         <?sourceFile "DMAMUX0_32CH_TRIG_MK28F15" ?>
         <name>DMAMUX0</name>
         <description>DMA channel multiplexor</description>
         <groupName>DMAMUX</groupName>
         <headerStructName>DMAMUX</headerStructName>
         <baseAddress>0x40021000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <?width "8" ?>
            <offset>0x0</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>32</dim>
               <dimIncrement>1</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
               <name>CHCFG%s</name>
               <description>Channel Configuration Register</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>SOURCE</name>
                     <description>DMA Channel Source (slot)\n
Specifies which DMA source, if any, is routed to a particular DMA channel</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Disable_Signal</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>TSI0_Signal</description>
                           <value>0b1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2</name>
                           <description>LPUART0_Rx_Signal</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3</name>
                           <description>LPUART0_Tx_Signal</description>
                           <value>0b11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4</name>
                           <description>LPUART1_Rx_Signal</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>5</name>
                           <description>LPUART1_Tx_Signal</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>6</name>
                           <description>LPUART2_Rx_Signal</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>7</name>
                           <description>LPUART2_Tx_Signal</description>
                           <value>0b111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8</name>
                           <description>LPUART3_Rx_Signal</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>9</name>
                           <description>LPUART3_Tx_Signal</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>10</name>
                           <description>LPUART4_Rx_Signal</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>11</name>
                           <description>LPUART4_Tx_Signal</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>12</name>
                           <description>I2S0_Rx_Signal</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>13</name>
                           <description>I2S0_Tx_Signal</description>
                           <value>0b1101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>14</name>
                           <description>SPI0_Rx_Signal</description>
                           <value>0b1110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>15</name>
                           <description>SPI0_Tx_Signal</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>16</name>
                           <description>SPI1_Rx_Signal</description>
                           <value>0b10000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>17</name>
                           <description>SPI1_Tx_Signal</description>
                           <value>0b10001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>18</name>
                           <description>I2C0_I2C3_Signal</description>
                           <value>0b10010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>19</name>
                           <description>I2C1_I2C2_Signal</description>
                           <value>0b10011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>20</name>
                           <description>FTM0_Channel0_Signal</description>
                           <value>0b10100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>21</name>
                           <description>FTM0_Channel1_Signal</description>
                           <value>0b10101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>22</name>
                           <description>FTM0_Channel2_Signal</description>
                           <value>0b10110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>23</name>
                           <description>FTM0_Channel3_Signal</description>
                           <value>0b10111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>24</name>
                           <description>FTM0_Channel4_Signal</description>
                           <value>0b11000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>25</name>
                           <description>FTM0_Channel5_Signal</description>
                           <value>0b11001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>26</name>
                           <description>FTM0_Channel6_Signal</description>
                           <value>0b11010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>27</name>
                           <description>FTM0_Channel7_Signal</description>
                           <value>0b11011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>28</name>
                           <description>FTM1_Channel0_Signal</description>
                           <value>0b11100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>29</name>
                           <description>FTM1_Channel1_Signal</description>
                           <value>0b11101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>30</name>
                           <description>FTM2_Channel0_Signal</description>
                           <value>0b11110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>31</name>
                           <description>FTM2_Channel1_Signal</description>
                           <value>0b11111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>32</name>
                           <description>FTM3_Channel0_Signal</description>
                           <value>0b100000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>33</name>
                           <description>FTM3_Channel1_Signal</description>
                           <value>0b100001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>34</name>
                           <description>FTM3_Channel2_Signal</description>
                           <value>0b100010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>35</name>
                           <description>FTM3_Channel3_Signal</description>
                           <value>0b100011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>36</name>
                           <description>FTM3_Channel4_Signal</description>
                           <value>0b100100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>37</name>
                           <description>FTM3_Channel5_Signal</description>
                           <value>0b100101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>38</name>
                           <description>FTM3_Channel6_Signal</description>
                           <value>0b100110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>39</name>
                           <description>FTM3_Channel7_Signal</description>
                           <value>0b100111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>40</name>
                           <description>ADC0_Signal</description>
                           <value>0b101000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>42</name>
                           <description>CMP0_Signal</description>
                           <value>0b101010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>43</name>
                           <description>CMP1_Signal</description>
                           <value>0b101011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>45</name>
                           <description>DAC0_Signal</description>
                           <value>0b101101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>47</name>
                           <description>CMT_Signal</description>
                           <value>0b101111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>48</name>
                           <description>PDB_Signal</description>
                           <value>0b110000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>49</name>
                           <description>PortA_Signal</description>
                           <value>0b110001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>50</name>
                           <description>PortB_Signal</description>
                           <value>0b110010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>51</name>
                           <description>PortC_Signal</description>
                           <value>0b110011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>52</name>
                           <description>PortD_Signal</description>
                           <value>0b110100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>53</name>
                           <description>PortE_Signal</description>
                           <value>0b110101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>58</name>
                           <description>SPI2_Rx_Signal</description>
                           <value>0b111010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>59</name>
                           <description>SPI2_Tx_Signal</description>
                           <value>0b111011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>60</name>
                           <description>AlwaysOn60_Signal</description>
                           <value>0b111100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>61</name>
                           <description>AlwaysOn61_Signal</description>
                           <value>0b111101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>62</name>
                           <description>AlwaysOn62_Signal</description>
                           <value>0b111110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>63</name>
                           <description>AlwaysOn63_Signal</description>
                           <value>0b111111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRIG</name>
                     <description>DMA Channel Trigger Enable\n
Enables the periodic trigger capability for the triggered DMA channel</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Request directed routed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Periodic triggering enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENBL</name>
                     <description>DMA Channel Enable\n
Usually the Channel enable in the DMA is used in preference to this</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Channel disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Channel enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
